In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [11]:
df1 = DataFrame({'key': ['X','Y','Z'], 'data_set_1':[1,2,3]})

In [12]:
df1

  key  data_set_1
0   X           1
1   Y           2
2   Z           3

In [19]:
df2 = DataFrame({'key': ['X','B','C'], 'data_set_2':[4,5,6]})

In [20]:
df2

  key  data_set_2
0   X           4
1   B           5
2   C           6

In [26]:
# on 参照letf,right两者相同数据列才可以进行合并操作
pd.merge(df1,df2,on='key')

  key  data_set_1  data_set_2
0   X           1           4

In [27]:
# how = inner 默认
pd.merge(df1, df2, on='key',how='inner')

  key  data_set_1  data_set_2
0   X           1           4

In [28]:
# how = outer 全合并，不存在的数据列会用NaN填充
pd.merge(df1, df2, on='key',how='outer')

  key  data_set_1  data_set_2
0   X         1.0         4.0
1   Y         2.0         NaN
2   Z         3.0         NaN
3   B         NaN         5.0
4   C         NaN         6.0

In [31]:
# how = left 左合并 参照df1数据列进行合并
pd.merge(df1, df2, on='key',how='left')

  key  data_set_1  data_set_2
0   X           1         4.0
1   Y           2         NaN
2   Z           3         NaN

In [30]:
# how = right 右合并 参照df2数据列进行合并
pd.merge(df1, df2, on='key',how='right')

  key  data_set_1  data_set_2
0   X         1.0           4
1   B         NaN           5
2   C         NaN           6